Enrique Tonatiuh Pérez Cortés Barba 739547

# A01 - Python

- Genera una lista de 100 elementos con múltiplos de 3. E.g. [3, 6, 9, ...]

In [4]:
multiplo= 0
lista=[]
for i in range(100):
    multiplo = multiplo+3
    lista.append(multiplo)
print(lista)

[3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 186, 189, 192, 195, 198, 201, 204, 207, 210, 213, 216, 219, 222, 225, 228, 231, 234, 237, 240, 243, 246, 249, 252, 255, 258, 261, 264, 267, 270, 273, 276, 279, 282, 285, 288, 291, 294, 297, 300]

- Toma el archivo datosPE.xlsx y calcula el índice de masa corporal de cada persona.

In [6]:
import pandas as pd
data = pd.read_excel("datosPE.xlsx")
data["IMC"]=data["Peso"]/data["Estatura"]
data

    ID Persona  Peso  Estatura        IMC
0            1    67      1.41  47.517730
1            2    99      1.83  54.098361
2            3    86      1.90  45.263158
3            4   118      1.65  71.515152
4            5   109      1.67  65.269461
..         ...   ...       ...        ...
95          96    88      1.49  59.060403
96          97    98      1.54  63.636364
97          98    95      1.57  60.509554
98          99    61      1.61  37.888199
99         100   107      1.62  66.049383

[100 rows x 4 columns]

- Toma el archivo datosCT.xlsx y
    - Calcula la Utilidad (Ingreso - Gasto)

In [9]:
data2 = pd.read_excel("datosCT.xlsx")
data2["Utilidad"]=data2["Ingreso"]-data2["Gasto"]
data2

    Unnamed: 0  Ingreso  Gasto  Utilidad
0        Enero     1340   1880      -540
1      Febrero     2590   3130      -540
2        Marzo     3570   2140      1430
3        Abril     4450   3370      1080
4         Mayo     1330   2990     -1660
5        Junio     1610   1970      -360
6        Julio     1500   2230      -730
7       Agosto     2270   1240      1030
8   Septiembre     1910   1470       440
9      Octubre     2120   2280      -160
10   Noviembre     3950   1870      2080
11   Diciembre     1380   3140     -1760

- encuentra el promedio de Gastos en los meses que la Utilidad fue negativa

In [28]:
listaGastos= []
prom=0
for i in range(data2["Utilidad"].size):
    if data2.iloc[i]["Utilidad"]<0:
        listaGastos.append(data2.iloc[i]["Gasto"]);
for j in range(len(listaGastos)):
    prom = listaGastos[j]+ prom
prom = prom/len(listaGastos)
print("En promedio, por mes se gastaron $", round(prom,3))

En promedio, por mes se gastaron $ 2517.143

- encuentra los ingresos totales del año

In [33]:
print("Los ingresos totales del año son $", data2["Ingreso"].sum())

Los ingresos totales del año son $ 28020